Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: If the file didn't exist before, and you run `git status`, you see your untracked file like so:
cs: Pokud soubor dříve neexistoval a vy spustíte příkaz `git status`, bude nesledovaný soubor uveden takto:

source: If the hard disk the central database is on becomes corrupted, and proper backups haven't been kept, you lose absolutely everything – the entire history of the project except whatever single snapshots people happen to have on their local machines.
cs: A dojde-li k poruše pevného disku, na němž je uložena centrální databáze, a disk nebyl správně zálohován, ztratíte úplně vše -- celou historii projektu, s výjimkou souborů aktuálních verzí, jež mají uživatelé v lokálních počítačích.

source: If the maintainers merge, rebase, or cherry-pick your work, you'll eventually get it back via pulling from their repository anyhow:
cs: Pokud správci provedou sloučení (merge), přeskládání (rebase) nebo částečné převzetí vaší práce (cherry-pick), budete stejně muset stáhnout změny z jejich repozitáře (pull):

source: If the manpages and this book aren't enough and you need in-person help, you can try the `#git` or `#github` channel on the Freenode IRC server (irc.freenode.net).
cs: Pokud nestačí ani manuálová stránka ani tato kniha a uvítali byste osobní pomoc, můžete zkusit kanál `#git` nebo `#github` na IRC serveru Freenode (irc.freenode.net).

source: If the update script exits non-zero, only that reference is rejected; other references can still be updated.
cs: Je-li výstup skriptu update nenulový, je zamítnuta pouze tato reference, ostatní mohou být aktualizovány.

source: If there is no output, then the patch should apply cleanly.
cs: Pokud se nezobrazí žádný výstup, záplata bude aplikována čistě.

source: If they want Git to do that automatically each time they run `git push origin`, they can add a `push` value to their config file:
cs: Chcete-li, aby toto Git provedl automaticky pokaždé, když spustíte příkaz `git push origin`, můžete do konfiguračního souboru vložit hodnotu `push`:

source: If this is better suited to your data, check the `fast-import` man page for details about how to provide your data in this manner.
cs: Pokud je pro vaše data tato metoda vhodnější, odkážeme vás na manuálovou stránku `fast-import`, kde najdete podrobnosti o tom, jak zadat data tímto způsobem.

source: If this script exits non-zero, Git aborts the commit process, so you can use it to validate your project state or commit message before allowing a commit to go through.
cs: Je-li návratová hodnota skriptu nenulová, Git přeruší proces zapisování. Skript tak můžete používat k validaci stavu projektu nebo zprávy k revizi, než dovolíte, aby byla revize zapsána.

source: If you *do* find yourself in a situation like this, Git has some further magic that might help you out.
cs: Když už se do takové situace dostanete, má Git v zásobě trochu magie, která vám z toho může pomoci ven.

source: If you add a remote and push to it, Git stores the value you last pushed to that remote for each branch in the `refs/remotes` directory.
cs: Přidáte-li vzdálený repozitář a odešlete do něj revize, Git v adresáři `refs/remotes` uloží pro každou větev hodnotu, kterou jste do tohoto repozitáře naposled odesílali.

source: If you already have a local branch and want to set it to a remote branch you just pulled down, or want to change the upstream branch you're tracking, you can use the `-u` or `--set-upstream-to` option to `git branch` to explicitly set it at any time.
cs: Pokud už máte lokální větev a chcete ji nastavit na vzdálenou větev, kterou jste právě stáhli (pull), nebo pokud chcete změnit upstream větev, kterou sledujete, můžete pro explicitní nastavení kdykoliv použít příkaz `git branch` s volbou `-u` nebo `--set-upstream-to`.

source: If you already have a shared filesystem to which your whole team has access, setting up a repository is very easy.
cs: Pokud už máte sdílený systém souborů, k němuž má přístup celý váš tým, je nastavení repozitáře velice jednoduché.

source: If you and a co-worker are working on the same project and they want you to check something out, running a command like `git pull /home/john/project` is often easier than them pushing to a remote server and you pulling down.
cs: Pokud vy a váš kolega pracujete na společném projektu a máte z něj něco přetáhnout, pak provedení příkazu jako `git pull /home/john/project` je často jednodušší, než aby jej on nejdříve odeslal (push) na vzdálený server a teprve z něho byste práci stahovali.

source: If you and someone else clone at the same time and they push upstream and then you push upstream, your push will rightly be rejected.
cs: Pokud ve stejnou dobu obsah naklonuje ještě někdo jiný a svou práci odešle na společný server (upstream), vaše později odesílaná práce bude oprávněně odmítnuta.

source: If you are a graphic or web designer and want to keep every version of an image or layout (which you would most certainly want to), a Version Control System (VCS) is a very wise thing to use.
cs: Pokud jste grafik nebo návrhář webů a chcete uchovávat všechny verze obrázku nebo rozložení stránky (což jistě chtít budete), je rozumné, když budete systém pro správu verzí (VCS z anglického Version Control System) používat.

source: If you are already comfortable with a centralized workflow in your company or team, you can easily continue using that workflow with Git.
cs: Pokud už jste ve své firmě nebo v týmu na centralizovaný pracovní postup zvyklí, můžete v něm snadno pokračovat i při použití Gitu.

source: If you are going to learn how to use Git then knowing how to use GitHub will help you take part in a huge community, which is valuable no matter which Git host you decide to use for your own code.
cs: Pokud se chcete naučit, jak používat Git, pak znalost toho, jak používat GitHub, vám pomůže stát se součástí obrovské komunity, což je cenné nezávisle na tom, jaký hostovaný Git si vyberete pro váš vlastní kód.

source: If you are not familiar with either of these editors, you may need to search for specific instructions for how to set up your favorite editor with Git.
cs: Pokud žádný z těchto editorů neznáte, měli byste si najít konkrétní instrukce, jak si můžete pro Git váš oblíbený editor nastavit.

source: If you are using Git for Windows 2.x or later, there is also a system-level config file at `C:\Documents and Settings\All Users\Application Data\Git\config` on Windows XP, and in `C:\ProgramData\Git\config` on Windows Vista and newer.
cs: Pokud používáte _Git for Windows_ verze 2.x nebo novější, existuje i konfigurační soubor na úrovni systému `C:\Documents and Settings\All Users\Application Data\Git\config` pro Windows XP a `C:\ProgramData\Git\config` pro Windows Vista a novější.

source: If you are using `git pull` and want to make `--rebase` the default, you can set the `pull.rebase` config value with something like `git config --global pull.rebase true`.
cs: Pokud používáte `git pull` a chcete, aby se z `--rebase` stala výchozí volba, můžete nastavit konfigurační hodnotu `pull.rebase` příkazem jako je `git config --global pull.rebase true`.

source: If you can read only one chapter to get going with Git, this is it.
cs: Pokud byste si o Gitu měli přečíst jen jednu kapitolu, měla by to být právě tahle.

source: If you can, encourage your contributors to use `format-patch` instead of `diff` to generate patches for you.
cs: Můžete-li, doporučte svým přispěvatelům, aby místo příkazu `diff` používali příkaz `format-patch`.

source: If you can, try to make your changes digestible – don't code for a whole weekend on five different issues and then submit them all as one massive commit on Monday.
cs: Pokud je to možné, snažte se, aby byly vaše změny stravitelné. Není právě ideální pracovat celý víkend na pěti různých problémech a v pondělí je všechny najednou odeslat formou jedné velké revize.

source: If you change a previously tracked file called ``CONTRIBUTING.md'' and then run your `git status` command again, you get something that looks like this:
cs: Pokud změníte už dříve sledovaný soubor s názvem `CONTRIBUTING.md` a poté znovu spustíte příkaz `git status`, zobrazí se něco takového:

source: If you change pick to edit on more lines, you can repeat these steps for each commit you change to edit.
cs: Změníte-li výraz pick na edit na více řádcích, můžete tyto kroky opakovat pro každou revizi, u níž jste změnu provedli.

source: If you changed the same part of the same file differently in the two branches you're merging together, Git won't be able to merge them cleanly.
cs: Pokud jste tutéž část stejného souboru změnili odlišně ve dvou větvích, které chcete sloučit, Git je nebude umět sloučit čistě.

source: If you check out one and then the other, you can see that they have different project roots:
cs: Provedete-li checkout jedné a posléze druhé větve, uvidíte, že mají jiné kořenové adresáře:

source: If you clone a repository, the command automatically adds that remote repository under the name ``origin''.
cs: Pokud vytvoříte klon nějakého repozitáře, příkaz automaticky přidá tento vzdálený repozitář pod názvem `origin`.

source: If you clone from this, Git's `clone` command automatically names it `origin` for you, pulls down all its data, creates a pointer to where its `master` branch is, and names it `origin/master` locally.
cs: Pokud z něj naklonujete, příkaz Gitu `clone` ho automaticky pojmenuje `origin`, stáhne z něj všechna data, vytvoří ukazatel, který bude označovat jeho větev `master` a lokálně ji pojmenuje `origin/master`.

source: If you commit at this point, the version of the file at the time you ran `git add` is what will be in the historical snapshot.
cs: Pokud v tomto okamžiku zapíšete revizi (commit), bude do historického snímku uložena verze souboru z okamžiku, kdy jste spustili příkaz `git add`.

source: If you commit now, the version of `CONTRIBUTING.md` as it was when you last ran the `git add` command is how it will go into the commit, not the version of the file as it looks in your working directory when you run `git commit`.
cs: Pokud nyní revizi zapíšete, stane se součástí snímku soubor `CONTRIBUTING.md` s obsahem, jaký měl, když jste naposledy spustili příkaz `git add`, a ne s obsahem, který měl v pracovním adresáři v okamžiku, kdy jste spustili příkaz `git commit`.

source: If you commit those changes and check out the file again, you see the keyword properly substituted:
cs: Pokud tyto změny zapíšete a provedete nový checkout souboru, uvidíte, že bylo klíčové slovo správně substituováno:

source: If you create a new branch, add a submodule there, and then switch back to a branch without that submodule, you still have the submodule directory as an untracked directory:
cs: Vytvoříte-li novou větev, přidáte do ní submodul a poté přepnete zpět na větev bez tohoto submodulu, není adresář submodulu stále ještě sledován:

source: If you create an annotated tag, Git creates a tag object and then writes a reference to point to it rather than directly to the commit.
cs: Vytvoříte-li anotovanou značku, Git vytvoří objekt značky a zapíše referenci, která na objekt ukazuje (neukazuje tedy na samotnou revizi).

source: If you created a working directory from the new tree you just wrote, you would get the two files in the top level of the working directory and a subdirectory named `bak` that contained the first version of the test.txt file.
cs: Pokud byste vytvořili pracovní adresář z nového stromu, který jste právě zapsali, dostali byste dva soubory na nejvyšší úrovni pracovního adresáře a podadresář `bak`, obsahující první verzi souboru test.txt.

source: If you decide to sign the tag as the maintainer, the tagging may look something like this:
cs: Pokud se rozhodnete podepsat značku jako správce, bude označení probíhat takto:

source: If you delete the subdirectory and then run `submodule add`, Git yells at you:
cs: Jestliže odstraníte podadresář a spustíte příkaz `submodule add`, Git vám vynadá:

source: If you did an import from another system or otherwise find that your repository is much larger than it should be, here is how you can find and remove large objects.
cs: Pokud provedete import do systému Git z jiného systému, nebo jiným způsobem zjistíte, že je váš repozitář výrazně větší, než by měl být, můžete vyhledat a odstranit velké objekty následovně.

source: If you didn't want it to be called `serverfix` on the remote, you could instead run `git push origin serverfix:awesomebranch` to push your local `serverfix` branch to the `awesomebranch` branch on the remote project.
cs: Pokud jste nechtěli, aby se větev ve vzdáleném repozitáři jmenovala `serverfix`, mohli jste místo toho spustit `git push origin serverfix:awesomebranch`. Pak by lokální větev `serverfix` byla odeslána do větve `awesomebranch` vzdáleného projektu.

source: If you do a `git pull`, you'll create a merge commit which includes both lines of history, and your repository will look like this:
cs: Pokud provedete `git pull`, vytvoříte bod sloučení (merge commit), který zahrnuje obě historické linie. Váš repozitář bude vypadat takto:

source: If you do happen to commit an object that hashes to the same SHA-1 value as a previous object in your repository, Git will see the previous object already in your Git database and assume it was already written.
cs: Pokud náhodou zapíšete objekt, který má stejnou hodnotu SHA-1 otisku jako předchozí objekt ve vašem repozitáři, Git už uvidí předchozí objekt v databázi Git a bude předpokládat, že už byl zapsán.

source: If you do sign your tags, you may have the problem of distributing the public PGP key used to sign your tags.
cs: Pokud své značky podepisujete, můžete mít problémy s distribucí veřejného klíče PGP použitého k podepsání značky.

source: If you do some work on your local `master` branch, and, in the meantime, someone else pushes to `git.ourcompany.com` and updates its `master` branch, then your histories move forward differently.
cs: Pokud budete pracovat v lokální větvi `master` a mezi tím někdo jiný něco odešle na `git.ourcompany.com` -- čímž aktualizuje větev `master` tohoto serveru --{empty}, budou se vaše historie vyvíjet odlišně.

source: If you do want to install Git from source, you need to have the following libraries that Git depends on: curl, zlib, openssl, expat, and libiconv.
cs: Pokud si chcete Git instalovat ze zdrojových textů, musí váš systém obsahovat následující knihovny, na nichž je Git závislý: curl, zlib, openssl, expat, a libiconv.

source: If you don't have it installed already, it will prompt you to install it.
cs: Pokud Git ještě není nainstalován, napoví vám, jak jej nainstalovat.

source: If you don't have write access, how does the project prefer to accept contributed work?
cs: Pokud oprávnění k zápisu nemáte, jaké metodě se dává přednost při přijímání příspěvků?

source: If you don't know what we're talking about here, you may need to stop and research that quickly so that you can follow the rest of the examples and descriptions in this book.
cs: Pokud nevíte, o čem je řeč, měli byste zde zastavit a rychle si to zjistit, abyste v knize mohli sledovat zbytek příkladů a popisů.

source: If you don't specify a message for an annotated tag, Git launches your editor so you can type it in.
cs: Pokud u anotované značky nezadáte žádnou zprávu, Git spustí textový editor, v němž zprávu zadáte.

source: If you don't want to type it every single time you push, you can set up a ``credential cache''.
cs: Pokud se vám to nechce zadávat při každém odesílání, můžete si nastavit „credential cache“, čili „mezipaměť pro pověřovací informace“.

source: If you don't want to type the entire text of each of the Git commands, you can easily set up an alias for each command using `git config`.(((git commands, config))) Here are a couple of examples you may want to set up:
cs: Pokud nechcete zadávat celý text gitových příkazů, můžete pomocí `git config` jednoduše nastavit pro každý příkaz tzv. alias.(((git příkazy, config))) Tady je pár příkladů, které možná budete chtít nastavit:

source: If you don't, people will hate you, and you'll be scorned by friends and family.
cs: Pokud ne, lidi vás budou nenávidět, přátelé a rodina vámi budou opovrhovat.

source: If you don’t have the signer’s public key, you get something like this instead:
cs: Pokud veřejný klíč podepisujícího nemáte, výstup bude vypadat následovně:

source: If you don’t know what is breaking, and there have been dozens or hundreds of commits since the last state where you know the code worked, you’ll likely turn to `git bisect` for help.
cs: Pokud nemáte ponětí, co může chybu způsobovat, a od posledního zaručeně funkčního stavu kódu byly zapsány desítky nebo stovky revizí, možná budete pomoc hledat raději u příkazu `git bisect`.

source: If you don’t specify a stash, Git assumes the most recent stash and tries to apply it:
cs: Pokud u příkazu neoznačíte konkrétní odklad, Git se automaticky pokusí aplikovat ten nejnovější:

source: If you download and install the `exiftool` program, you can use it to convert your images into text about the metadata, so at least the diff will show you a textual representation of any changes that happened:
cs: Pokud stáhnete a nainstalujete program `exiftool`, můžete ho použít ke konverzi obrázků na text prostřednictvím metadat, a nástroj diff vám tak přinejmenším zobrazí textovou verzi všech provedených změn.

source: If you ever need help while using Git, there are three ways to get the manual page (manpage) help for any of the Git commands:
cs: Budete-li někdy při používání Gitu potřebovat pomoc, existují tři způsoby, jak můžete pro libovolný z příkazů Gitu vyvolat manuálovou stránku s nápovědou:

source: If you examine the log of a rebased branch, it looks like a linear history: it appears that all the work happened in series, even when it originally happened in parallel.
cs: Pokud si prohlížíte log přeskládané větve, vypadá jako lineární historie. Zdá se, jako kdyby veškeré práce probíhaly postupně, i když původně proběhly paralelně.

source: If you follow that guideline, you'll be fine.
cs: Pokud se budete touto zásadou řídit, budete v pohodě.

source: If you follow those guidelines, working with a Subversion server can be more bearable.
cs: Budete-li dodržovat tato pravidla, bude práce se serverem Subversion snesitelnější.

source: If you get on an airplane or a train and want to do a little work, you can commit happily until you get to a network connection to upload.
cs: Jste-li v letadle nebo ve vlaku a chcete pokračovat v práci, můžete beze všeho zapisovat nové revize. Ty odešlete až po opětovném připojení k síti.

source: If you go back to an earlier example from <<_basic_merging>>, you can see that you diverged your work and made commits on two different branches.
cs: Pokud se vrátíte k dřívějšímu příkladu v <<_basic_merging>>, vidíte, že jste se při práci odchýlili a vznikly objekty revize ve dvou různých větvích.

source: If you go home and can't get your VPN client working properly, you can still work.
cs: Jestliže přijedete domů a zjistíte, že VPN klient nefunguje, stále můžete pracovat.

source: If you go into the new `libgit2` directory, you'll see the project files in there, ready to be worked on or used.
cs: Přejdete-li do nového adresáře `libgit2`, uvidíte v něm soubory projektu připravené ke zpracování nebo jinému použití.

source: If you had run that instead, you’d have gotten back to your original position:
cs: Pokud jste spustili příkaz v této podobě, vrátili jste se zpět na svou původní pozici:

source: If you have a branch named `serverfix` that you want to work on with others, you can push it up the same way you pushed your first branch.
cs: Máte-li větev s názvem `serverfix`, na níž chcete spolupracovat s ostatními, můžete ji odeslat stejným způsobem, jakým jste odesílali svou první větev.

source: If you have a branch set up to track a remote branch (see the next section and <<_git_branching>> for more information), you can use the `git pull` command to automatically fetch and then merge a remote branch into your current branch.(((git commands, pull))) This may be an easier or more comfortable workflow for you; and by default, the `git clone` command automatically sets up your local master branch to track the remote master branch (or whatever the default branch is called) on the server you cloned from.
cs: Pokud máte větev nastavenou ke sledování vzdálené větve (více informací naleznete v následující podkapitole a v kapitole <<_git_branching>>), můžete použít příkaz `git pull`, který automaticky vyzvedne (fetch) a poté začlení (merge) vzdálenou větev do vaší aktuální větve.(((git příkazy, pull))) Tento postup pro vás může být snazší a pohodlnější. Standardně přitom příkaz `git clone` automaticky nastaví vaši lokální větev `master` tak, aby sledovala vzdálenou větev `master` (výchozí větev může být i jiná) na serveru, z kterého jste klonovali.

source: If you have a complex workflow process that has a QA team pushing branches, developers pushing branches, and integration teams pushing and collaborating on remote branches, you can namespace them easily this way.
cs: Jestliže používáte komplexní pracovní proces, kdy QA tým odesílá větve, vývojáři odesílají větve a integrační týmy odesílají větve a spolupracují na nich, můžete takto jednoduše využít možností, jež vám jmenný prostor nabízí.

source: If you have a lot of tags that you want to push up at once, you can also use the `--tags` option to the `git push` command.
cs: Máte-li značek více a chcete je odeslat všechny najednou, můžete také u příkazu `git push` použít volbu `--tags`.

source: If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.
cs: Máte-li připojený sdílený systém souborů, můžete klonovat, odesílat a stahovat z lokálního souborového repozitáře.

source: If you have a tracking branch set up as demonstrated in the last section, either by explicitly setting it or by having it created for you by the `clone` or `checkout` commands, `git pull` will look up what server and branch your current branch is tracking, fetch from that server and then try to merge in that remote branch.
cs: Pokud máte sledující větev nastavenou podle ukázky z minulé části -- buď explicitním příkazem nebo tím, že byla vytvořena příkazy `clone` nebo `checkout` --, podívá se příkaz `git pull` jaký server a jakou větev vaše současná větev sleduje, vyzvedne změny ze serveru a pokusí se vzdálenou větev začlenit (merge).

source: If you have it read the message from the file passed as the first argument and compare that to the pattern, you can force Git to abort the commit if there is no match:
cs: Necháte-li zásuvný modul přečíst zprávu k revizi ze souboru, který zadáte jako první parametr, a srovnat se vzorem, můžete systému Git uložit, aby odmítl revize, které vzoru neodpovídají:

source: If you have more than one remote, the command lists them all.
cs: Pokud používáte více než jeden vzdálený repozitář, příkaz je vypíše všechny.

source: If you have multiple submodules, you’ll have multiple entries in this file.
cs: Máte-li submodulů více, bude v tomto souboru několik záznamů.

source: If you have no interest in running your own server, you can skip to the last section of the chapter to see some options for setting up a hosted account and then move on to the next chapter, where we discuss the various ins and outs of working in a distributed source control environment.
cs: Pokud víte, že nebudete chtít spravovat vlastní server, můžete přeskočit rovnou na poslední část této kapitoly a podívat se na možnosti nastavení hostovaného účtu. Pak přejděte na následující kapitolu, v níž se dočtete o detailech a záludnostech při práci v prostředí s distribuovanou správou zdrojového kódu.
